Nothing applied yet.
Plan for ACM module:
```diff
  # module.acm["scdev.aws.iohkdev.io"].aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "scdev.aws.iohkdev.io"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scdev.aws.iohkdev.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "scdev.aws.iohkdev.io"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.scdev.aws.iohkdev.io",
          + "scdev.aws.iohkdev.io",
        ]
      + tags_all                  = {
          + "Environment"  = "prod"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm["scdev.aws.iohkdev.io"].aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)

      + timeouts {}
    }

  # module.acm["scdev.aws.iohkdev.io"].aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z10147571DRRDCJXSER5Y"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ acm_certificate_arns = [
        "arn:aws:acm:us-east-1:677160962006:certificate/59835939-f801-4fa1-8313-21c1887c33ab",
      + (known after apply),
        "arn:aws:acm:us-east-1:677160962006:certificate/00f9ffa6-d0b0-4eab-bcfa-0383d6eea5b6",
    ]
```
